#+AUTHOR: lf-araujo 
#+TITLE: Notebook system for the Mx team
#+OPTIONS: toc:2
#+PROPERTY: header-args :tangle init.el
#+SETUPFILE: "./style.theme"
#+STARTUP: latexpreview

*Abstract |* A Notebook system based on Emacs borrowing from existing config files. This system  works from a single org file as an attempt to be as easy as possible for non-emacs users. It handles analyses in any language supported by org and through any server with a ssh interface. Since, its contents (an org file) are automatically rendered in Github or similar, it is trivial to share analyses results with reviewers and auditors, thus providing a way for transparent review/auditing of statistical analyses. This configuration provides a more complete set of functionality than jupyter, with less hassle.

*** Or your tables

#+BEGIN_SRC R :session test :exports both :results output
library(tableone)

## Load Mayo Clinic Primary Biliary Cirrhosis Data
library(survival)
data(pbc)

## Make categorical variables factors
varsToFactor <- c("status","trt","ascites","hepato","spiders","edema","stage")
pbc[varsToFactor] <- lapply(pbc[varsToFactor], factor)

## Create a variable list
dput(names(pbc))
vars <- c("time","status","age","sex","ascites","hepato",
          "spiders","edema","bili","chol","albumin",
          "copper","alk.phos","ast","trig","platelet",
          "protime","stage")

## Create Table 1 stratified by trt
tableOne <- CreateTableOne(vars = vars, strata = c("trt"), data = pbc)

## Just typing the object name will invoke the print.TableOne method
print(tableOne)

#+END_SRC

#+RESULTS:
| 158               | 154               |       |
| 2015.62 (1094.12) | 1996.86 (1155.93) | 0.883 |
|                   |                   | 0.894 |
| 83 (52.5)         | 85 (55.2)         |       |
| 10 ( 6.3)         | 9 ( 5.8)          |       |
| 65 (41.1)         | 60 (39.0)         |       |
| 51.42 (11.01)     | 48.58 (9.96)      | 0.018 |
| 137 (86.7)        | 139 (90.3)        | 0.421 |
| 14 ( 8.9)         | 10 ( 6.5)         | 0.567 |
| 73 (46.2)         | 87 (56.5)         | 0.088 |
| 45 (28.5)         | 45 (29.2)         | 0.985 |
|                   |                   | 0.877 |
| 132 (83.5)        | 131 (85.1)        |       |
| 16 (10.1)         | 13 ( 8.4)         |       |
| 10 ( 6.3)         | 10 ( 6.5)         |       |
| 2.87 (3.63)       | 3.65 (5.28)       | 0.131 |
| 365.01 (209.54)   | 373.88 (252.48)   | 0.748 |
| 3.52 (0.44)       | 3.52 (0.40)       | 0.874 |
| 97.64 (90.59)     | 97.65 (80.49)     | 0.999 |
| 2021.30 (2183.44) | 1943.01 (2101.69) | 0.747 |
| 120.21 (54.52)    | 124.97 (58.93)    |  0.46 |
| 124.14 (71.54)    | 125.25 (58.52)    | 0.886 |
| 258.75 (100.32)   | 265.20 (90.73)    | 0.555 |
| 10.65 (0.85)      | 10.80 (1.14)      | 0.197 |
|                   |                   | 0.201 |
| 12 ( 7.6)         | 4 ( 2.6)          |       |
| 35 (22.2)         | 32 (20.8)         |       |
| 56 (35.4)         | 64 (41.6)         |       |
| 55 (34.8)         | 54 (35.1)         |       |


** You can pass org tables directly to your R/python/whathever language code

#+NAME: with-rownames
| one | 1 | 2 | 3 | 4 |  5 |
| two | 6 | 7 | 8 | 9 | 10 |

#+BEGIN_SRC R :var tab=with-rownames :rownames yes
print(tab)
#+END_SRC

#+RESULTS:
| one | 1 | 2 | 3 | 4 |  5 |
| two | 6 | 7 | 8 | 9 | 10 |


